Tekla Open API Reference for Tekla Structures 2025
ReinforcementPulloutElement.ScaleX Property
 Gets or sets the scaling of the pull-out in the X direction.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double ScaleX { get; set; }
Public Property ScaleX As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ReinforcementPulloutElement Class
Tekla.Structures.Drawing Namespace